Tekla Open API Reference for Tekla Structures 2025
Operation.MoveObject Method
Overload List
Name | Description
MoveObject(ModelObject, Vector)
 Moves the model object using the given translation vector.
MoveObject(ModelObject, CoordinateSystem, CoordinateSystem)
 Moves the model object between the given translation coordinate systems.
Top
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace